Documents/РазрешениеНаЗаменуМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РазрешениеНаЗаменуМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Catalog.РесурсныеСпецификации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АналогиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРазрешенийНаЗаменуМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказаниеПоПрименению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязиСпецификация</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РазрешениеНаЗаменуМатериалов/Forms/ФормаВводаОбластиДействия/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвойств = "НаправлениеДеятельности,"
					+ "ЗаказНаПроизводство,"
					+ "ЗаказКлиента,"
					+ "Подразделение,"
					+ "Спецификация,"
					+ "Изделие,"
					+ "ХарактеристикаИзделия,"
					+ "КоличествоМатериалов";
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокСвойств);
	
	ИспользоватьНаправлениеДеятельности = ЗначениеЗаполнено(НаправлениеДеятельности);
	ИспользоватьЗаказНаПроизводство = ЗначениеЗаполнено(ЗаказНаПроизводство);
	ИспользоватьЗаказКлиента = ЗначениеЗаполнено(ЗаказКлиента);
	ИспользоватьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	//++ Устарело_Производство21
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2") Тогда
	//-- Устарело_Производство21	
		Если ЗначениеЗаполнено(ЗаказКлиента) 
			ИЛИ ЗначениеЗаполнено(ЗаказНаПроизводство) 
				И ТипЗнч(ЗаказНаПроизводство) <> Тип("ДокументСсылка.ЗаказНаПроизводство2_2")Тогда
			ТолькоПросмотр = Истина;
			Элементы.ФормаОК.Доступность = Ложь;
		Иначе
			Элементы.ЗаказНаПроизводство.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2");
			Элементы.ИспользоватьЗаказКлиента.Видимость = Ложь;
			Элементы.ЗаказКлиента.Видимость = Ложь;
		КонецЕсли;
	//++ Устарело_Производство21
	Иначе
		Элементы.ЗаказНаПроизводство.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство");
	КонецЕсли;
	//-- Устарело_Производство21
	
	Если ЗначениеЗаполнено(Спецификация) Тогда
		
		ИспользоватьИзделие = Истина;
		РежимИспользованиеИзделие = 1;
		ПоСпецификации = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Изделие) Тогда
		
		ИспользоватьИзделие = Истина;
		РежимИспользованиеИзделие = 0;
		
		Если ЗначениеЗаполнено(ХарактеристикаИзделия) Тогда
			ИспользуютсяХарактеристикиДляТекущегоИзделия = Истина;
			ИспользоватьХарактеристикуИзделия = Истина;
		Иначе
			ИспользуютсяХарактеристикиДляТекущегоИзделия = ПризнакИспользованияХарактеристикНаСервере(Изделие);
			ИспользоватьХарактеристикуИзделия = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Спецификация) ИЛИ КоличествоМатериалов > 0 Тогда
		УведомлятьОбИзмененииРежима = Истина;
	КонецЕсли;
	
	УстановитьДоступность();

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ТекстВопроса = НСтр("ru='Данные были изменены. Перенести изменения в документ?';uk='Дані були змінені. Перенести зміни в документ?'");
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы, ТекстВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьНаправлениеДеятельностиПриИзменении(Элемент)
	Элементы.НаправлениеДеятельности.Доступность = ИспользоватьНаправлениеДеятельности;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказНаПроизводствоПриИзменении(Элемент)
	Элементы.ЗаказНаПроизводство.Доступность = ИспользоватьЗаказНаПроизводство;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказКлиентаПриИзменении(Элемент)
	Элементы.ЗаказКлиента.Доступность = ИспользоватьЗаказКлиента;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодразделениеПриИзменении(Элемент)
	Элементы.Подразделение.Доступность = ИспользоватьПодразделение;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИзделиеПриИзменении(Элемент)
	
	ИспользоватьХарактеристикуИзделия = Ложь;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользуютсяХарактеристикиДляТекущегоИзделия
	);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСпецификацииПриИзменении(Элемент)
	
	Если УведомлятьОбИзмененииРежима Тогда
		
		ТекстВопроса = НСтр("ru='Изменение области действия приведет к очистке 
|табличной части ""Набор заменяемых материалов"".
|Продолжить?'
|;uk='Зміна області дії призведе до очищення 
|табличній частині ""Набір замінних матеріалів"". 
|Продовжити?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоСпецификацииПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	ПоСпецификацииПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСпецификацииПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        УведомлятьОбИзмененииРежима = Ложь;
		ПоСпецификацииПриИзмененииФрагмент();
	Иначе
		РежимИспользованиеИзделие = 0;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПоСпецификацииПриИзмененииФрагмент()
	
    ИспользоватьХарактеристикуИзделия = Ложь;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользуютсяХарактеристикиДляТекущегоИзделия
	);	

КонецПроцедуры

&НаКлиенте
Процедура СпецификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если УведомлятьОбИзмененииРежима Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстВопроса = НСтр("ru='Изменение спецификации приведет к очистке табличной части ""Материалы"", продолжить?';uk='Зміна специфікації призведе до очищення табличної частини ""Матеріали"", продовжити?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("СпецификацияНачалоВыбораЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПроизводимомуИзделиюПриИзменении(Элемент)
	
	ИспользоватьХарактеристикуИзделия = Ложь;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользуютсяХарактеристикиДляТекущегоИзделия
	);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	
	ИспользоватьХарактеристикуИзделия = Ложь;
	
	Если ЗначениеЗаполнено(Изделие) Тогда
		ИспользуютсяХарактеристикиДляТекущегоИзделия = ПризнакИспользованияХарактеристикНаСервере(Изделие);
	Иначе
		ИспользуютсяХарактеристикиДляТекущегоИзделия = Ложь;
	КонецЕсли;
	
	Элементы.ИспользоватьХарактеристикуИзделия.Доступность = ИспользуютсяХарактеристикиДляТекущегоИзделия;
	Элементы.ХарактеристикаИзделия.Доступность = ИспользоватьХарактеристикуИзделия;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьХарактеристикуИзделияПриИзменении(Элемент)
	Элементы.ХарактеристикаИзделия.Доступность = ИспользоватьХарактеристикуИзделия;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Модифицированность Тогда
		ЗавершитьРедактирование();
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РезультатРедактированияНаСервере()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НаправлениеДеятельности", ?(ЗначениеЗаполнено(НаправлениеДеятельности) И ИспользоватьНаправлениеДеятельности,
		НаправлениеДеятельности, Справочники.НаправленияДеятельности.ПустаяСсылка()));
		
	Результат.Вставить("ЗаказНаПроизводство", ?(ЗначениеЗаполнено(ЗаказНаПроизводство) И ИспользоватьЗаказНаПроизводство,
		ЗаказНаПроизводство, Неопределено));
		
	Результат.Вставить("ЗаказКлиента", ?(ЗначениеЗаполнено(ЗаказКлиента) И ИспользоватьЗаказКлиента,
		ЗаказКлиента, Документы.ЗаказКлиента.ПустаяСсылка()));
		
	Результат.Вставить("Подразделение", ?(ЗначениеЗаполнено(Подразделение) И ИспользоватьПодразделение,
		Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));
		
	Результат.Вставить("Спецификация", ?(ЗначениеЗаполнено(Спецификация) И ИспользоватьИзделие И РежимИспользованиеИзделие = 1,
		Спецификация, Справочники.РесурсныеСпецификации.ПустаяСсылка()));
		
	Результат.Вставить("Изделие", ?(ЗначениеЗаполнено(Изделие) И ИспользоватьИзделие И РежимИспользованиеИзделие = 0,
		Изделие, Справочники.Номенклатура.ПустаяСсылка()));
		
	Результат.Вставить("ХарактеристикаИзделия", ?(ЗначениеЗаполнено(ХарактеристикаИзделия) И ИспользоватьХарактеристикуИзделия,
		ХарактеристикаИзделия, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРедактирование()
	
	Отказ = Ложь;
	
	// Проверка заполнения
	ОчиститьСообщения();
	
	Если ИспользоватьНаправлениеДеятельности И Не ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Направление деятельности"" не заполнено';uk='Поле ""Напрям діяльності"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "НаправлениеДеятельности", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьЗаказНаПроизводство И Не ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Заказ на производство"" не заполнено';uk='Полі ""Замовлення на виробництво"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ЗаказНаПроизводство", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьЗаказКлиента И Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Заказ клиента"" не заполнено';uk='Поле ""Заказ клієнта"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ЗаказКлиента", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьПодразделение И Не ЗначениеЗаполнено(Подразделение) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Подразделение"" не заполнено';uk='Полі ""Підрозділ"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Подразделение", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьИзделие И РежимИспользованиеИзделие = 1 И Не ЗначениеЗаполнено(Спецификация) Тогда	
		ТекстОшибки = НСтр("ru='Поле ""Спецификация"" не заполнено';uk='Поле ""Специфікація"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Спецификация", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьИзделие И РежимИспользованиеИзделие = 0 И Не ЗначениеЗаполнено(Изделие) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Номенклатура"" не заполнено';uk='Поле ""Номенклатура"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Изделие", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьХарактеристикуИзделия И Не ЗначениеЗаполнено(ХарактеристикаИзделия) Тогда
		ТекстОшибки = НСтр("ru='Поле ""Характеристика"" не заполнено';uk='Поле ""Характеристика"" не заповнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ХарактеристикаИзделия", , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	СтруктураВыбора = Новый Структура();
	СтруктураВыбора.Вставить("ВыполняемаяОперация", "ВыборОбластиДействия");
	СтруктураВыбора.Вставить("ЗначениеВыбора", РезультатРедактированияНаСервере());
	
	ОповеститьОВыборе(СтруктураВыбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	Элементы.НаправлениеДеятельности.Доступность = ИспользоватьНаправлениеДеятельности;
	Элементы.ЗаказНаПроизводство.Доступность = ИспользоватьЗаказНаПроизводство;
	Элементы.ЗаказКлиента.Доступность = ИспользоватьЗаказКлиента;
	Элементы.Подразделение.Доступность = ИспользоватьПодразделение;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользуютсяХарактеристикиДляТекущегоИзделия
	);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИзделие(Элементы, ПризнакДоступности, РежимДоступности, ИспользованиеХарактеристики)
	
	ДоступностьСпецификация = ПризнакДоступности И (РежимДоступности = 1);
	ДоступностьИзделие = ПризнакДоступности И (РежимДоступности = 0);   
	
	Элементы.ПоСпецификации.Доступность = ПризнакДоступности;	
	Элементы.ПоПроизводимомуИзделию.Доступность = ПризнакДоступности;	
	
	Элементы.Спецификация.Доступность = ДоступностьСпецификация;
	Элементы.СпецификацияНадпись.Доступность = ДоступностьСпецификация;
	
	Элементы.Изделие.Доступность = ДоступностьИзделие;
	Элементы.ИзделиеНадпись.Доступность = ДоступностьИзделие;
	
	Элементы.ИспользоватьХарактеристикуИзделия.Доступность = ДоступностьИзделие И ИспользованиеХарактеристики;
	Элементы.ХарактеристикаИзделия.Доступность = ДоступностьИзделие И ИспользованиеХарактеристики;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПризнакИспользованияХарактеристикНаСервере(Номенклатура)
	
	ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ИспользованиеХарактеристик");
	
	Если ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры 
		Или ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры
		Или ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат, ДополнительныеПараметры) Экспорт 
	
	ЗавершитьРедактирование();
	
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УведомлятьОбИзмененииРежима = Ложь;
		ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаВыбора",, Элементы.Спецификация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
